aaron-bond.better-comments
dbaeumer.vscode-eslint
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.code-runner
hookyqr.beautify
james-yu.latex-workshop
julialang.language-julia
marus25.cortex-debug
ms-azuretools.vscode-docker
ms-python.python
ms-toolsai.jupyter
ms-vscode.cpptools
shardulm94.trailing-spaces
vscode-icons-team.vscode-icons