aaron-bond.better-comments
bnavetta.zoterolatex
dbaeumer.vscode-eslint
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.code-runner
genuitecllc.codetogether
GitHub.copilot
James-Yu.latex-workshop
joaompinto.vscode-graphviz
julialang.language-julia
marus25.cortex-debug
mblode.zotero
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
ms-python.isort
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
shardulm94.trailing-spaces
slevesque.vscode-3dviewer
SonarSource.sonarlint-vscode
tatsy.vscode-3d-preview
vscode-icons-team.vscode-icons